app/controllers/school_classes_controller.rb

  def update
    @school_class = SchoolClass.update(school_class_params)
---
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Science"], ["room_number", 5], ["updated_at", "2020-12-17 20:21:45.978401"], ["id", 3]]