app/controllers/students_controller.rb

  def update
    @student = Student.update(student_params)
---
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Samuel"], ["last_name", "Uneze"], ["updated_at", "2020-12-17 20:33:37.729206"], ["id", 1]]